{
  "document_id": "123",
  "chunk_type": "semantic",
  "language": "en",
  "num_chunks": 4,
  "chunks": [
    {
      "hash": "e3d4f766d5b993ad",
      "content": "Hesburgh is also credited with transforming the face of Notre Dame by making it a coeducational institution. In the mid-1960s Notre Dame and Saint Mary's College developed a co-exchange program whereby several hundred students took classes not offered at their home institution, an arrangement that added undergraduate women to a campus that already had a few women in the graduate schools.",
      "start_idx": 0,
      "end_idx": 384,
      "sequence_num": 0,
      "metadata": {
        "topic": "Transformation of Notre Dame into a coeducational institution",
        "keywords": [
          "Hesburgh",
          "coeducation",
          "Notre Dame",
          "Saint Mary's College"
        ]
      },
      "chunk_type": "semantic"
    },
    {
      "hash": "e30c91cc24371d76",
      "content": "After extensive debate, merging with St. Mary's was rejected, primarily because of the differential in faculty qualifications and pay scales. \"In American college education,\" explained the Rev. Charles E. Sheedy, C.S.C., Notre Dame's Dean of Arts and Letters, \"certain features formerly considered advantageous and enviable are now seen as anachronistic and out of place.... In this environment of diversity, the integration of the sexes is a normal and expected aspect, replacing separatism.\"",
      "start_idx": 384,
      "end_idx": 634,
      "sequence_num": 1,
      "metadata": {
        "topic": "Debate on merging with St. Mary's and views on coeducation",
        "keywords": [
          "merging",
          "faculty qualifications",
          "coeducation",
          "diversity"
        ]
      },
      "chunk_type": "semantic"
    },
    {
      "hash": "fc82ae2ddc9284a9",
      "content": "Thomas Blantz, C.S.C., Notre Dame's Vice President of Student Affairs, added that coeducation \"opened up a whole other pool of very bright students.\" Two of the male residence halls were converted for the newly admitted female students that first year, while two others were converted for the next school year.",
      "start_idx": 634,
      "end_idx": 786,
      "sequence_num": 2,
      "metadata": {
        "topic": "Impact of coeducation on student demographics and campus facilities",
        "keywords": [
          "Thomas Blantz",
          "coeducation",
          "residence halls",
          "student demographics"
        ]
      },
      "chunk_type": "semantic"
    },
    {
      "hash": "ba13887d35521bae",
      "content": "In 1971 Mary Ann Proctor became the first female undergraduate; she transferred from St. Mary's College. In 1972 the first woman to graduate was Angela Sienko, who earned a bachelor's degree in marketing.",
      "start_idx": 786,
      "end_idx": 883,
      "sequence_num": 3,
      "metadata": {
        "topic": "Milestones in female undergraduate admissions and graduation",
        "keywords": [
          "Mary Ann Proctor",
          "Angela Sienko",
          "first female undergraduate",
          "graduation"
        ]
      },
      "chunk_type": "semantic"
    }
  ],
  "created_at": "2025-08-10T10:04:26.825778",
  "embedding_model": "text-embedding-3-large",
  "additional_metadata": {
    "run_id": "exp_20250810_081040",
    "language": "en",
    "query_id": null,
    "model": "text-embedding-3-large"
  }
}