{
  "document_id": "360",
  "chunk_type": "langchain_semantic",
  "language": "en",
  "num_chunks": 3,
  "chunks": [
    {
      "hash": "6ac6a32f250ae318",
      "content": "The group changed their name to Destiny's Child in 1996, based upon a passage in the Book of Isaiah. In 1997, Destiny's Child released their major label debut song \"Killing Time\" on the soundtrack to the 1997 film, Men in Black. The following year, the group released their self-titled debut album, scoring their first major hit \"No, No, No\".",
      "start_idx": 0,
      "end_idx": 342,
      "sequence_num": 0,
      "metadata": {
        "group_size": 3,
        "similarity_threshold": 0.75
      },
      "chunk_type": "langchain_semantic"
    },
    {
      "hash": "a1dfb9705261372c",
      "content": "The album established the group as a viable act in the music industry, with moderate sales and winning the group three Soul Train Lady of Soul Awards for Best R&B/Soul Album of the Year, Best R&B/Soul or Rap New Artist, and Best R&B/Soul Single for \"No, No, No\". The group released their multi-platinum second album The Writing's on the Wall in 1999. The record features some of the group's most widely known songs such as \"Bills, Bills, Bills\", the group's first number-one single, \"Jumpin' Jumpin'\" and \"Say My Name\", which became their most successful song at the time, and would remain one of their signature songs.",
      "start_idx": 343,
      "end_idx": 962,
      "sequence_num": 1,
      "metadata": {
        "group_size": 3,
        "similarity_threshold": 0.75
      },
      "chunk_type": "langchain_semantic"
    },
    {
      "hash": "272e1dbe3e377954",
      "content": "\"Say My Name\" won the Best R&B Performance by a Duo or Group with Vocals and the Best R&B Song at the 43rd Annual Grammy Awards. The Writing's on the Wall sold more than eight million copies worldwide. During this time, Beyoncé recorded a duet with Marc Nelson, an original member of Boyz II Men, on the song \"After All Is Said and Done\" for the soundtrack to the 1999 film, The Best Man.",
      "start_idx": 963,
      "end_idx": 1351,
      "sequence_num": 2,
      "metadata": {
        "group_size": 3,
        "similarity_threshold": 0.75
      },
      "chunk_type": "langchain_semantic"
    }
  ],
  "created_at": "2025-08-10T14:09:50.234545",
  "embedding_model": "text-embedding-3-large",
  "additional_metadata": {
    "run_id": "exp_20250810_081040",
    "language": "en",
    "query_id": null,
    "model": "text-embedding-3-large"
  }
}