{
  "document_id": "337",
  "chunk_type": "fixed_size",
  "language": "en",
  "num_chunks": 3,
  "chunks": [
    {
      "hash": "e80297563b41c0cb",
      "content": "At age eight, Beyoncé and childhood friend Kelly Rowland met LaTavia Roberson while in an audition for an all-girl entertainment group. They were placed into a group with three other girls as Girl's Tyme, and rapped and danced on the talent show circuit in Houston. After seeing the group, R&B producer Arne Frager brought them to his Northern California studio and placed them in Star Search, the largest talent show on national TV at the time.",
      "start_idx": 0,
      "end_idx": 445,
      "sequence_num": 0,
      "metadata": {
        "chunk_method": "fixed_size",
        "overlap_size": 0,
        "step_size": 461,
        "boundary_adjusted": true
      },
      "chunk_type": "fixed_size"
    },
    {
      "hash": "94af642bcf53979c",
      "content": "led to win, and Beyoncé later said the song they performed was not good. In 1995 Beyoncé's father resigned from his job to manage the group. The move reduced Beyoncé's family's income by half, and her parents were forced to move into separated apartments. Mathew cut the original line-up to four and the group continued performing as an opening act for other established R&B girl groups. The girls auditioned before record labels and were finally signed to Elektra Records, moving to Atlanta Records briefly to w",
      "start_idx": 461,
      "end_idx": 973,
      "sequence_num": 1,
      "metadata": {
        "chunk_method": "fixed_size",
        "overlap_size": 51,
        "step_size": 461,
        "boundary_adjusted": false
      },
      "chunk_type": "fixed_size"
    },
    {
      "hash": "84d55813c92e594f",
      "content": "tra Records, moving to Atlanta Records briefly to work on their first recording, only to be cut by the company. This put further strain on the family, and Beyoncé's parents separated. On October 5, 1995, Dwayne Wiggins's Grass Roots Entertainment signed the group. In 1996, the girls began recording their debut album under an agreement with Sony Music, the Knowles family reunited, and shortly after, the group got a contract with Columbia Records.",
      "start_idx": 922,
      "end_idx": 1371,
      "sequence_num": 2,
      "metadata": {
        "chunk_method": "fixed_size",
        "overlap_size": 51,
        "step_size": 461,
        "boundary_adjusted": false
      },
      "chunk_type": "fixed_size"
    }
  ],
  "created_at": "2025-08-10T08:40:59.387081",
  "embedding_model": "text-embedding-3-large",
  "additional_metadata": {
    "run_id": "exp_20250810_081040",
    "language": "en",
    "query_id": null,
    "model": "text-embedding-3-large"
  }
}