{
  "document_id": "382",
  "chunk_type": "fixed_size",
  "language": "en",
  "num_chunks": 3,
  "chunks": [
    {
      "hash": "a7bab0cd774b5833",
      "content": "The remaining band members recorded \"Independent Women Part I\", which appeared on the soundtrack to the 2000 film, Charlie's Angels. It became their best-charting single, topping the U.S. Billboard Hot 100 chart for eleven consecutive weeks. In early 2001, while Destiny's Child was completing their third album, Beyoncé landed a major role in the MTV made-for-television film, Carmen: A Hip Hopera, starring alongside American actor Mekhi Phifer.",
      "start_idx": 0,
      "end_idx": 447,
      "sequence_num": 0,
      "metadata": {
        "chunk_method": "fixed_size",
        "overlap_size": 0,
        "step_size": 461,
        "boundary_adjusted": true
      },
      "chunk_type": "fixed_size"
    },
    {
      "hash": "52f026cb32bdc14b",
      "content": "elphia, the film is a modern interpretation of the 19th century opera Carmen by French composer Georges Bizet. When the third album Survivor was released in May 2001, Luckett and Roberson filed a lawsuit claiming that the songs were aimed at them. The album debuted at number one on the U.S. Billboard 200, with first-week sales of 663,000 copies sold. The album spawned other number-one hits, \"Bootylicious\" and the title track, \"Survivor\", the latter of which earned the group a Grammy Award for Best R&B Perfo",
      "start_idx": 461,
      "end_idx": 973,
      "sequence_num": 1,
      "metadata": {
        "chunk_method": "fixed_size",
        "overlap_size": 51,
        "step_size": 461,
        "boundary_adjusted": false
      },
      "chunk_type": "fixed_size"
    },
    {
      "hash": "f12e6ebcfa4406f4",
      "content": " earned the group a Grammy Award for Best R&B Performance by a Duo or Group with Vocals. After releasing their holiday album 8 Days of Christmas in October 2001, the group announced a hiatus to further pursue solo careers.",
      "start_idx": 922,
      "end_idx": 1144,
      "sequence_num": 2,
      "metadata": {
        "chunk_method": "fixed_size",
        "overlap_size": 51,
        "step_size": 461,
        "boundary_adjusted": false
      },
      "chunk_type": "fixed_size"
    }
  ],
  "created_at": "2025-08-10T08:35:29.013249",
  "embedding_model": "text-embedding-3-large",
  "additional_metadata": {
    "run_id": "exp_20250810_081040",
    "language": "en",
    "query_id": null,
    "model": "text-embedding-3-large"
  }
}