{
  "document_id": "127",
  "chunk_type": "recursive",
  "language": "en",
  "num_chunks": 4,
  "chunks": [
    {
      "hash": "441ece0bddb24897",
      "content": "Hesburgh is also credited with transforming the face of Notre Dame by making it a coeducational institution. In the mid-1960s Notre Dame and Saint Mary's College developed a co-exchange program whereby several hundred students took classes not offered at their home institution, an arrangement that added undergraduate women to a campus that already had a few women in the graduate schools. After extensive debate, merging with St. Mary's was rejected, primarily because of the differential in faculty qualificat",
      "start_idx": 0,
      "end_idx": 512,
      "sequence_num": 0,
      "metadata": {
        "chunk_overlap": 50
      },
      "chunk_type": "recursive"
    },
    {
      "hash": "68335f7e0f6853f6",
      "content": " because of the differential in faculty qualifications and pay scales. \"In American college education,\" explained the Rev. Charles E. Sheedy, C.S.C., Notre Dame's Dean of Arts and Letters, \"certain features formerly considered advantageous and enviable are now seen as anachronistic and out of place.... In this environment of diversity, the integration of the sexes is a normal and expected aspect, replacing separatism.\" Thomas Blantz, C.S.C., Notre Dame's Vice President of Student Affairs, added that coeduca",
      "start_idx": 462,
      "end_idx": 974,
      "sequence_num": 1,
      "metadata": {
        "chunk_overlap": 50
      },
      "chunk_type": "recursive"
    },
    {
      "hash": "743d1dc09d9b845e",
      "content": "e President of Student Affairs, added that coeducation \"opened up a whole other pool of very bright students.\" Two of the male residence halls were converted for the newly admitted female students that first year, while two others were converted for the next school year. In 1971 Mary Ann Proctor became the first female undergraduate; she transferred from St. Mary's College. In 1972 the first woman to graduate was Angela Sienko, who earned a bachelor's degree in marketing.",
      "start_idx": 924,
      "end_idx": 1400,
      "sequence_num": 2,
      "metadata": {
        "chunk_overlap": 50
      },
      "chunk_type": "recursive"
    },
    {
      "hash": "68b098c9548c268d",
      "content": " in marketing.",
      "start_idx": 1386,
      "end_idx": 1400,
      "sequence_num": 3,
      "metadata": {
        "chunk_overlap": 50
      },
      "chunk_type": "recursive"
    }
  ],
  "created_at": "2025-08-10T12:56:44.274278",
  "embedding_model": "text-embedding-3-large",
  "additional_metadata": {
    "run_id": "exp_20250810_081040",
    "language": "en",
    "query_id": null,
    "model": "text-embedding-3-large"
  }
}