{
  "document_id": "110",
  "chunk_type": "keyword",
  "language": "en",
  "num_chunks": 2,
  "chunks": [
    {
      "hash": "74a1a77ed08c51c5",
      "content": "Holy Cross Father John Francis O'Hara was elected vice-president in 1933 and president of Notre Dame in 1934. During his tenure at Notre Dame, he brought numerous refugee intellectuals to campus; he selected Frank H. Spearman, Jeremiah D. M. Ford, Irvin Abell, and Josephine Brownson for the Laetare Medal, instituted in 1883. O'Hara strongly believed that the Fighting Irish football team could be an effective means to \"acquaint the public with the ideals that dominate\" Notre Dame.",
      "start_idx": 0,
      "end_idx": 484,
      "sequence_num": 0,
      "metadata": {
        "key_sentence": "Holy Cross Father John Francis O'Hara was elected vice-president in 1933 and president of Notre Dame in 1934.",
        "importance_score": 0.9,
        "context_window": 2,
        "keywords": [
          "John Francis O'Hara",
          "Notre Dame",
          "president",
          "1934"
        ]
      },
      "chunk_type": "keyword"
    },
    {
      "hash": "db011e04a72623ff",
      "content": "During his tenure at Notre Dame, he brought numerous refugee intellectuals to campus; he selected Frank H. Spearman, Jeremiah D. M. Ford, Irvin Abell, and Josephine Brownson for the Laetare Medal, instituted in 1883. O'Hara strongly believed that the Fighting Irish football team could be an effective means to \"acquaint the public with the ideals that dominate\" Notre Dame. He wrote, \"Notre Dame football is a spiritual service because it is played for the honor and glory of God and of his Blessed Mother. When St. Paul said: 'Whether you eat or drink, or whatsoever else you do, do all for the glory of God,' he included football.\"",
      "start_idx": 110,
      "end_idx": 744,
      "sequence_num": 1,
      "metadata": {
        "key_sentence": "He wrote, 'Notre Dame football is a spiritual service because it is played for the honor and glory of God and of his Blessed Mother.'",
        "importance_score": 0.75,
        "context_window": 2,
        "keywords": [
          "spiritual service",
          "Notre Dame football",
          "honor",
          "God"
        ]
      },
      "chunk_type": "keyword"
    }
  ],
  "created_at": "2025-08-10T11:14:55.817055",
  "embedding_model": "text-embedding-3-large",
  "additional_metadata": {
    "run_id": "exp_20250810_081040",
    "language": "en",
    "query_id": null,
    "model": "text-embedding-3-large"
  }
}