{
  "document_id": "139",
  "chunk_type": "keyword",
  "language": "en",
  "num_chunks": 3,
  "chunks": [
    {
      "hash": "031cf81b446c3571",
      "content": "Because of its Catholic identity, a number of religious buildings stand on campus. The Old College building has become one of two seminaries on campus run by the Congregation of Holy Cross. The current Basilica of the Sacred Heart is located on the spot of Fr.",
      "start_idx": 0,
      "end_idx": 260,
      "sequence_num": 0,
      "metadata": {
        "key_sentence": "Because of its Catholic identity, a number of religious buildings stand on campus.",
        "importance_score": 0.7,
        "context_window": 2,
        "keywords": [
          "Catholic identity",
          "religious buildings",
          "campus"
        ]
      },
      "chunk_type": "keyword"
    },
    {
      "hash": "e31b7417cc5ebb3e",
      "content": "The current Basilica of the Sacred Heart is located on the spot of Fr. Sorin's original church, which became too small for the growing college. It is built in French Revival style and it is decorated by stained glass windows imported directly from France. The interior was painted by Luigi Gregori, an Italian painter invited by Fr. Sorin to be artist in residence.",
      "start_idx": 190,
      "end_idx": 555,
      "sequence_num": 1,
      "metadata": {
        "key_sentence": "It is built in French Revival style and it is decorated by stained glass windows imported directly from France.",
        "importance_score": 0.8,
        "context_window": 2,
        "keywords": [
          "French Revival style",
          "stained glass windows",
          "France"
        ]
      },
      "chunk_type": "keyword"
    },
    {
      "hash": "7f196fc9bf46a5b0",
      "content": "The Basilica also features a bell tower with a carillon. Inside the church there are also sculptures by Ivan Mestrovic. The Grotto of Our Lady of Lourdes, which was built in 1896, is a replica of the original in Lourdes, France. It is very popular among students and alumni as a place of prayer and meditation, and it is considered one of the most beloved spots on campus.",
      "start_idx": 556,
      "end_idx": 928,
      "sequence_num": 2,
      "metadata": {
        "key_sentence": "The Grotto of Our Lady of Lourdes, which was built in 1896, is a replica of the original in Lourdes, France.",
        "importance_score": 0.75,
        "context_window": 2,
        "keywords": [
          "Grotto of Our Lady of Lourdes",
          "1896",
          "replica"
        ]
      },
      "chunk_type": "keyword"
    }
  ],
  "created_at": "2025-08-10T10:41:25.499133",
  "embedding_model": "text-embedding-3-large",
  "additional_metadata": {
    "run_id": "exp_20250810_081040",
    "language": "en",
    "query_id": null,
    "model": "text-embedding-3-large"
  }
}