{
  "document_id": "157",
  "chunk_type": "keyword",
  "language": "en",
  "num_chunks": 2,
  "chunks": [
    {
      "hash": "ffdeb902c11079e4",
      "content": "The university owns several centers around the world used for international studies and research, conferences abroad, and alumni support. The university has had a presence in London, England, since 1968. Since 1998, its London center has been based in the former United University Club at 1 Suffolk Street in Trafalgar Square.",
      "start_idx": 0,
      "end_idx": 326,
      "sequence_num": 0,
      "metadata": {
        "key_sentence": "The university owns several centers around the world used for international studies and research, conferences abroad, and alumni support.",
        "importance_score": 0.9,
        "context_window": 2,
        "keywords": [
          "university",
          "centers",
          "international studies",
          "research",
          "conferences",
          "alumni support"
        ]
      },
      "chunk_type": "keyword"
    },
    {
      "hash": "9ba887007d1ea6b8",
      "content": "The university has had a presence in London, England, since 1968. Since 1998, its London center has been based in the former United University Club at 1 Suffolk Street in Trafalgar Square. The center enables the Colleges of Arts & Letters, Business Administration, Science, Engineering and the Law School to develop their own programs in London, as well as hosting conferences and symposia. Other Global Gateways are located in Beijing, Chicago, Dublin, Jerusalem and Rome.",
      "start_idx": 138,
      "end_idx": 611,
      "sequence_num": 1,
      "metadata": {
        "key_sentence": "The center enables the Colleges of Arts & Letters, Business Administration, Science, Engineering and the Law School to develop their own programs in London, as well as hosting conferences and symposia.",
        "importance_score": 0.8,
        "context_window": 2,
        "keywords": [
          "center",
          "Colleges",
          "programs",
          "London",
          "conferences",
          "symposia"
        ]
      },
      "chunk_type": "keyword"
    }
  ],
  "created_at": "2025-08-10T11:04:15.656050",
  "embedding_model": "text-embedding-3-large",
  "additional_metadata": {
    "run_id": "exp_20250810_081040",
    "language": "en",
    "query_id": null,
    "model": "text-embedding-3-large"
  }
}