{
  "document_id": "168",
  "chunk_type": "keyword",
  "language": "en",
  "num_chunks": 2,
  "chunks": [
    {
      "hash": "26959f39d6e54d94",
      "content": "The College of Science was established at the university in 1865 by president Father Patrick Dillon. Dillon's scientific courses were six years of work, including higher-level mathematics courses. Today the college, housed in the newly built Jordan Hall of Science, includes over 1,200 undergraduates in six departments of study – biology, chemistry, mathematics, physics, pre-professional studies, and applied and computational mathematics and statistics (ACMS) – each awarding Bachelor of Science (B.S.)",
      "start_idx": 0,
      "end_idx": 505,
      "sequence_num": 0,
      "metadata": {
        "key_sentence": "The College of Science was established at the university in 1865 by president Father Patrick Dillon.",
        "importance_score": 0.7,
        "context_window": 2,
        "keywords": [
          "College of Science",
          "established",
          "1865",
          "Father Patrick Dillon"
        ]
      },
      "chunk_type": "keyword"
    },
    {
      "hash": "46a862a00f9b81f8",
      "content": "Dillon's scientific courses were six years of work, including higher-level mathematics courses. Today the college, housed in the newly built Jordan Hall of Science, includes over 1,200 undergraduates in six departments of study – biology, chemistry, mathematics, physics, pre-professional studies, and applied and computational mathematics and statistics (ACMS) – each awarding Bachelor of Science (B.S.) degrees. According to university statistics, its science pre-professional program has one of the highest acceptance rates to medical school of any university in the United States.",
      "start_idx": 101,
      "end_idx": 685,
      "sequence_num": 1,
      "metadata": {
        "key_sentence": "Each department awards Bachelor of Science (B.S.) degrees.",
        "importance_score": 0.5,
        "context_window": 2,
        "keywords": [
          "Bachelor of Science",
          "B.S. degrees"
        ]
      },
      "chunk_type": "keyword"
    }
  ],
  "created_at": "2025-08-10T11:04:41.543500",
  "embedding_model": "text-embedding-3-large",
  "additional_metadata": {
    "run_id": "exp_20250810_081040",
    "language": "en",
    "query_id": null,
    "model": "text-embedding-3-large"
  }
}