{
  "document_id": "173",
  "chunk_type": "keyword",
  "language": "en",
  "num_chunks": 2,
  "chunks": [
    {
      "hash": "681cc0d12fd5e875",
      "content": "The School of Architecture was established in 1899, although degrees in architecture were first awarded by the university in 1898. Today the school, housed in Bond Hall, offers a five-year undergraduate program leading to the Bachelor of Architecture degree. All undergraduate students study the third year of the program in Rome.",
      "start_idx": 0,
      "end_idx": 330,
      "sequence_num": 0,
      "metadata": {
        "key_sentence": "The School of Architecture was established in 1899, although degrees in architecture were first awarded by the university in 1898.",
        "importance_score": 0.7,
        "context_window": 2,
        "keywords": [
          "School of Architecture",
          "established 1899",
          "degrees awarded 1898"
        ]
      },
      "chunk_type": "keyword"
    },
    {
      "hash": "4f6239ddc0460950",
      "content": "Today the school, housed in Bond Hall, offers a five-year undergraduate program leading to the Bachelor of Architecture degree. All undergraduate students study the third year of the program in Rome. The university is globally recognized for its Notre Dame School of Architecture, a faculty that teaches (pre-modernist) traditional and classical architecture and urban planning (e.g. following the principles of New Urbanism and New Classical Architecture). It also awards the renowned annual Driehaus Architecture Prize.",
      "start_idx": 131,
      "end_idx": 652,
      "sequence_num": 1,
      "metadata": {
        "key_sentence": "The university is globally recognized for its Notre Dame School of Architecture, a faculty that teaches (pre-modernist) traditional and classical architecture and urban planning.",
        "importance_score": 0.9,
        "context_window": 2,
        "keywords": [
          "Notre Dame School of Architecture",
          "traditional architecture",
          "urban planning"
        ]
      },
      "chunk_type": "keyword"
    }
  ],
  "created_at": "2025-08-10T10:56:27.360383",
  "embedding_model": "text-embedding-3-large",
  "additional_metadata": {
    "run_id": "exp_20250810_081040",
    "language": "en",
    "query_id": null,
    "model": "text-embedding-3-large"
  }
}