{
  "document_id": "245",
  "chunk_type": "keyword",
  "language": "en",
  "num_chunks": 2,
  "chunks": [
    {
      "hash": "fe8689ebaa1ea7ab",
      "content": "Football gameday traditions During home games, activities occur all around campus and different dorms decorate their halls with a traditional item (e.g. Zahm House's two-story banner). Traditional activities begin at the stroke of midnight with the Drummers' Circle.",
      "start_idx": 0,
      "end_idx": 266,
      "sequence_num": 0,
      "metadata": {
        "key_sentence": "During home games, activities occur all around campus and different dorms decorate their halls with a traditional item (e.g. Zahm House's two-story banner).",
        "importance_score": 0.7,
        "context_window": 2,
        "keywords": [
          "home games",
          "campus activities",
          "dorm decorations"
        ]
      },
      "chunk_type": "keyword"
    },
    {
      "hash": "ae55df77a8b905c4",
      "content": "Traditional activities begin at the stroke of midnight with the Drummers' Circle. This tradition involves the drum line of the Band of the Fighting Irish and ushers in the rest of the festivities that will continue the rest of the gameday Saturday. Later that day, the trumpet section will play the Notre Dame Victory March and the Notre Dame Alma Mater under the dome. The band entire will play a concert at the steps of Bond Hall, from where they will march into Notre Dame Stadium, leading fans and students alike across campus to the game.",
      "start_idx": 185,
      "end_idx": 728,
      "sequence_num": 1,
      "metadata": {
        "key_sentence": "Later that day, the trumpet section will play the Notre Dame Victory March and the Notre Dame Alma Mater under the dome.",
        "importance_score": 0.9,
        "context_window": 2,
        "keywords": [
          "trumpet section",
          "Notre Dame Victory March",
          "Alma Mater"
        ]
      },
      "chunk_type": "keyword"
    }
  ],
  "created_at": "2025-08-10T10:48:59.509409",
  "embedding_model": "text-embedding-3-large",
  "additional_metadata": {
    "run_id": "exp_20250810_081040",
    "language": "en",
    "query_id": null,
    "model": "text-embedding-3-large"
  }
}