{
  "document_id": "249",
  "chunk_type": "keyword",
  "language": "en",
  "num_chunks": 3,
  "chunks": [
    {
      "hash": "e7f81aca72bb0217",
      "content": "The men's basketball team has over 1,600 wins, one of only 12 schools who have reached that mark, and have appeared in 28 NCAA tournaments. Former player Austin Carr holds the record for most points scored in a single game of the tournament with 61. Although the team has never won the NCAA Tournament, they were named by the Helms Athletic Foundation as national champions twice.",
      "start_idx": 0,
      "end_idx": 380,
      "sequence_num": 0,
      "metadata": {
        "key_sentence": "The men's basketball team has over 1,600 wins, one of only 12 schools who have reached that mark, and have appeared in 28 NCAA tournaments.",
        "importance_score": 0.9,
        "context_window": 2,
        "keywords": [
          "men's basketball team",
          "1,600 wins",
          "NCAA tournaments"
        ]
      },
      "chunk_type": "keyword"
    },
    {
      "hash": "cf9bc0510562333d",
      "content": "Former player Austin Carr holds the record for most points scored in a single game of the tournament with 61. Although the team has never won the NCAA Tournament, they were named by the Helms Athletic Foundation as national champions twice. The team has orchestrated a number of upsets of number one ranked teams, the most notable of which was ending UCLA's record 88-game winning streak in 1974. The team has beaten an additional eight number-one teams, and those nine wins rank second, to UCLA's 10, all-time in wins against the top team. The team plays in newly renovated Purcell Pavilion (within the Edmund P. Joyce Center), which reopened for the beginning of the 2009–2010 season.",
      "start_idx": 140,
      "end_idx": 826,
      "sequence_num": 1,
      "metadata": {
        "key_sentence": "The team has orchestrated a number of upsets of number one ranked teams, the most notable of which was ending UCLA's record 88-game winning streak in 1974.",
        "importance_score": 0.85,
        "context_window": 2,
        "keywords": [
          "upsets",
          "UCLA",
          "88-game winning streak"
        ]
      },
      "chunk_type": "keyword"
    },
    {
      "hash": "2357f1d56cdc9604",
      "content": "In 2009 they were invited to the NIT, where they advanced to the semifinals but were beaten by Penn State who went on and beat Baylor in the championship. The 2010–11 team concluded its regular season ranked number seven in the country, with a record of 25–5, Brey's fifth straight 20-win season, and a second-place finish in the Big East. During the 2014-15 season, the team went 32-6 and won the ACC conference tournament, later advancing to the Elite 8, where the Fighting Irish lost on a missed buzzer-beater against then undefeated Kentucky. Led by NBA draft picks Jerian Grant and Pat Connaughton, the Fighting Irish beat the eventual national champion Duke Blue Devils twice during the season. The 32 wins were the most by the Fighting Irish team since 1908-09.",
      "start_idx": 952,
      "end_idx": 1720,
      "sequence_num": 2,
      "metadata": {
        "key_sentence": "During the 2014-15 season, the team went 32-6 and won the ACC conference tournament, later advancing to the Elite 8, where the Fighting Irish lost on a missed buzzer-beater against then undefeated Kentucky.",
        "importance_score": 0.8,
        "context_window": 2,
        "keywords": [
          "2014-15 season",
          "32-6",
          "Elite 8",
          "Kentucky"
        ]
      },
      "chunk_type": "keyword"
    }
  ],
  "created_at": "2025-08-10T11:14:16.988468",
  "embedding_model": "text-embedding-3-large",
  "additional_metadata": {
    "run_id": "exp_20250810_081040",
    "language": "en",
    "query_id": null,
    "model": "text-embedding-3-large"
  }
}