{
  "document_id": "28",
  "chunk_type": "keyword",
  "language": "en",
  "num_chunks": 3,
  "chunks": [
    {
      "hash": "ca314428fd8c155f",
      "content": "The university first offered graduate degrees, in the form of a Master of Arts (MA), in the 1854–1855 academic year. The program expanded to include Master of Laws (LL.M.) and Master of Civil Engineering in its early stages of growth, before a formal graduate school education was developed with a thesis not required to receive the degrees.",
      "start_idx": 0,
      "end_idx": 341,
      "sequence_num": 0,
      "metadata": {
        "key_sentence": "The university first offered graduate degrees, in the form of a Master of Arts (MA), in the 1854–1855 academic year.",
        "importance_score": 0.9,
        "context_window": 2,
        "keywords": [
          "graduate degrees",
          "Master of Arts",
          "1854"
        ]
      },
      "chunk_type": "keyword"
    },
    {
      "hash": "fe6a03317a3e5f49",
      "content": "The program expanded to include Master of Laws (LL.M.) and Master of Civil Engineering in its early stages of growth, before a formal graduate school education was developed with a thesis not required to receive the degrees. This changed in 1924 with formal requirements developed for graduate degrees, including offering Doctorate (PhD) degrees. Today each of the five colleges offer graduate education. Most of the departments from the College of Arts and Letters offer PhD programs, while a professional Master of Divinity (M.Div.)",
      "start_idx": 117,
      "end_idx": 651,
      "sequence_num": 1,
      "metadata": {
        "key_sentence": "This changed in 1924 with formal requirements developed for graduate degrees, including offering Doctorate (PhD) degrees.",
        "importance_score": 0.85,
        "context_window": 2,
        "keywords": [
          "formal requirements",
          "Doctorate",
          "PhD"
        ]
      },
      "chunk_type": "keyword"
    },
    {
      "hash": "412aeec08b60cec3",
      "content": "All of the departments in the College of Science offer PhD programs, except for the Department of Pre-Professional Studies. The School of Architecture offers a Master of Architecture, while each of the departments of the College of Engineering offer PhD programs. The College of Business offers multiple professional programs including MBA and Master of Science in Accountancy programs. It also operates facilities in Chicago and Cincinnati for its executive MBA program. Additionally, the Alliance for Catholic Education program offers a Master of Education program where students study at the university during the summer and teach in Catholic elementary schools, middle schools, and high schools across the Southern United States for two school years.",
      "start_idx": 673,
      "end_idx": 1427,
      "sequence_num": 2,
      "metadata": {
        "key_sentence": "The College of Business offers multiple professional programs including MBA and Master of Science in Accountancy programs.",
        "importance_score": 0.75,
        "context_window": 2,
        "keywords": [
          "College of Business",
          "MBA",
          "Master of Science"
        ]
      },
      "chunk_type": "keyword"
    }
  ],
  "created_at": "2025-08-10T10:40:43.090777",
  "embedding_model": "text-embedding-3-large",
  "additional_metadata": {
    "run_id": "exp_20250810_081040",
    "language": "en",
    "query_id": null,
    "model": "text-embedding-3-large"
  }
}