{
  "document_id": "30",
  "chunk_type": "keyword",
  "language": "en",
  "num_chunks": 2,
  "chunks": [
    {
      "hash": "bd585bffca55fd4d",
      "content": "The Joan B. Kroc Institute for International Peace Studies at the University of Notre Dame is dedicated to research, education and outreach on the causes of violent conflict and the conditions for sustainable peace. It offers PhD, Master's, and undergraduate degrees in peace studies. It was founded in 1986 through the donations of Joan B. Kroc, the widow of McDonald's owner Ray Kroc.",
      "start_idx": 0,
      "end_idx": 386,
      "sequence_num": 0,
      "metadata": {
        "key_sentence": "The Joan B. Kroc Institute for International Peace Studies at the University of Notre Dame is dedicated to research, education and outreach on the causes of violent conflict and the conditions for sustainable peace.",
        "importance_score": 1.0,
        "context_window": 2,
        "keywords": [
          "Kroc Institute",
          "peace studies",
          "violent conflict",
          "sustainable peace"
        ]
      },
      "chunk_type": "keyword"
    },
    {
      "hash": "774a53e01b8fc3c1",
      "content": "It offers PhD, Master's, and undergraduate degrees in peace studies. It was founded in 1986 through the donations of Joan B. Kroc, the widow of McDonald's owner Ray Kroc. The institute was inspired by the vision of the Rev. Theodore M. Hesburgh CSC, President Emeritus of the University of Notre Dame. The institute has contributed to international policy discussions about peace building practices.",
      "start_idx": 216,
      "end_idx": 615,
      "sequence_num": 1,
      "metadata": {
        "key_sentence": "The institute was inspired by the vision of the Rev. Theodore M. Hesburgh CSC, President Emeritus of the University of Notre Dame.",
        "importance_score": 0.5,
        "context_window": 2,
        "keywords": [
          "Rev. Theodore M. Hesburgh",
          "vision",
          "inspiration"
        ]
      },
      "chunk_type": "keyword"
    }
  ],
  "created_at": "2025-08-10T10:40:46.062233",
  "embedding_model": "text-embedding-3-large",
  "additional_metadata": {
    "run_id": "exp_20250810_081040",
    "language": "en",
    "query_id": null,
    "model": "text-embedding-3-large"
  }
}