{
  "document_id": "421",
  "chunk_type": "keyword",
  "language": "en",
  "num_chunks": 2,
  "chunks": [
    {
      "hash": "7f3de13284e6995e",
      "content": "In November 2003, she embarked on the Dangerously in Love Tour in Europe and later toured alongside Missy Elliott and Alicia Keys for the Verizon Ladies First Tour in North America. On February 1, 2004, Beyoncé performed the American national anthem at Super Bowl XXXVIII, at the Reliant Stadium in Houston, Texas. After the release of Dangerously in Love, Beyoncé had planned to produce a follow-up album using several of the left-over tracks.",
      "start_idx": 0,
      "end_idx": 444,
      "sequence_num": 0,
      "metadata": {
        "key_sentence": "In November 2003, she embarked on the Dangerously in Love Tour in Europe and later toured alongside Missy Elliott and Alicia Keys for the Verizon Ladies First Tour in North America.",
        "importance_score": 0.7,
        "context_window": 2,
        "keywords": [
          "Dangerously in Love Tour",
          "Missy Elliott",
          "Alicia Keys",
          "Verizon Ladies First Tour"
        ]
      },
      "chunk_type": "keyword"
    },
    {
      "hash": "c174567de4f78a60",
      "content": "After the release of Dangerously in Love, Beyoncé had planned to produce a follow-up album using several of the left-over tracks. However, this was put on hold so she could concentrate on recording Destiny Fulfilled, the final studio album by Destiny's Child. Released on November 15, 2004, in the US and peaking at number two on the Billboard 200, Destiny Fulfilled included the singles \"Lose My Breath\" and \"Soldier\", which reached the top five on the Billboard Hot 100 chart. Destiny's Child embarked on a worldwide concert tour, Destiny Fulfilled... and Lovin' It and during the last stop of their European tour, in Barcelona on June 11, 2005, Rowland announced that Destiny's Child would disband following the North American leg of the tour. The group released their first compilation album Number 1's on October 25, 2005, in the US and accepted a star on the Hollywood Walk of Fame in March 2006.",
      "start_idx": 315,
      "end_idx": 1217,
      "sequence_num": 1,
      "metadata": {
        "key_sentence": "Released on November 15, 2004, in the US and peaking at number two on the Billboard 200, Destiny Fulfilled included the singles 'Lose My Breath' and 'Soldier', which reached the top five on the Billboard Hot 100 chart.",
        "importance_score": 0.8,
        "context_window": 2,
        "keywords": [
          "Destiny Fulfilled",
          "Billboard 200",
          "Lose My Breath",
          "Soldier"
        ]
      },
      "chunk_type": "keyword"
    }
  ],
  "created_at": "2025-08-10T11:22:55.330098",
  "embedding_model": "text-embedding-3-large",
  "additional_metadata": {
    "run_id": "exp_20250810_081040",
    "language": "en",
    "query_id": null,
    "model": "text-embedding-3-large"
  }
}