{
  "document_id": "429",
  "chunk_type": "keyword",
  "language": "en",
  "num_chunks": 2,
  "chunks": [
    {
      "hash": "19d493b2965ef42f",
      "content": "Beyoncé's second solo album B'Day was released on September 5, 2006, in the US, to coincide with her twenty-fifth birthday. It sold 541,000 copies in its first week and debuted atop the Billboard 200, becoming Beyoncé's second consecutive number-one album in the United States. The album's lead single \"Déjà Vu\", featuring Jay Z, reached the top five on the Billboard Hot 100 chart.",
      "start_idx": 0,
      "end_idx": 382,
      "sequence_num": 0,
      "metadata": {
        "key_sentence": "Beyoncé's second solo album B'Day was released on September 5, 2006, in the US, to coincide with her twenty-fifth birthday.",
        "importance_score": 0.9,
        "context_window": 2,
        "keywords": [
          "Beyoncé",
          "B'Day",
          "release date",
          "birthday"
        ]
      },
      "chunk_type": "keyword"
    },
    {
      "hash": "b20c798cf5379c22",
      "content": "It sold 541,000 copies in its first week and debuted atop the Billboard 200, becoming Beyoncé's second consecutive number-one album in the United States. The album's lead single \"Déjà Vu\", featuring Jay Z, reached the top five on the Billboard Hot 100 chart. The second international single \"Irreplaceable\" was a commercial success worldwide, reaching number one in Australia, Hungary, Ireland, New Zealand and the United States. B'Day also produced three other singles; \"Ring the Alarm\", \"Get Me Bodied\", and \"Green Light\" (released in the United Kingdom only).",
      "start_idx": 124,
      "end_idx": 686,
      "sequence_num": 1,
      "metadata": {
        "key_sentence": "The second international single 'Irreplaceable' was a commercial success worldwide, reaching number one in Australia, Hungary, Ireland, New Zealand and the United States.",
        "importance_score": 0.9,
        "context_window": 2,
        "keywords": [
          "Irreplaceable",
          "international single",
          "commercial success"
        ]
      },
      "chunk_type": "keyword"
    }
  ],
  "created_at": "2025-08-10T11:25:16.171103",
  "embedding_model": "text-embedding-3-large",
  "additional_metadata": {
    "run_id": "exp_20250810_081040",
    "language": "en",
    "query_id": null,
    "model": "text-embedding-3-large"
  }
}