{
  "document_id": "471",
  "chunk_type": "keyword",
  "language": "en",
  "num_chunks": 2,
  "chunks": [
    {
      "hash": "537afbd35c9ecc07",
      "content": "Beyoncé further expanded her acting career, starring as blues singer Etta James in the 2008 musical biopic, Cadillac Records. Her performance in the film received praise from critics, and she garnered several nominations for her portrayal of James, including a Satellite Award nomination for Best Supporting Actress, and a NAACP Image Award nomination for Outstanding Supporting Actress. Beyoncé donated her entire salary from the film to Phoenix House, an organization of rehabilitation centers for heroin addicts around the country.",
      "start_idx": 0,
      "end_idx": 534,
      "sequence_num": 0,
      "metadata": {
        "key_sentence": "Beyoncé further expanded her acting career, starring as blues singer Etta James in the 2008 musical biopic, Cadillac Records.",
        "importance_score": 0.9,
        "context_window": 2,
        "keywords": [
          "Beyoncé",
          "acting career",
          "Etta James",
          "Cadillac Records"
        ]
      },
      "chunk_type": "keyword"
    },
    {
      "hash": "38fe514086592319",
      "content": "Beyoncé starred opposite Ali Larter and Idris Elba in the thriller, Obsessed. She played Sharon Charles, a mother and wife who learns of a woman's obsessive behavior over her husband. Although the film received negative reviews from critics, the movie did well at the US box office, grossing $68 million—$60 million more than Cadillac Records—on a budget of $20 million. The fight scene finale between Sharon and the character played by Ali Larter also won the 2010 MTV Movie Award for Best Fight.",
      "start_idx": 635,
      "end_idx": 1132,
      "sequence_num": 1,
      "metadata": {
        "key_sentence": "Although the film received negative reviews from critics, the movie did well at the US box office, grossing $68 million—$60 million more than Cadillac Records—on a budget of $20 million.",
        "importance_score": 0.75,
        "context_window": 2,
        "keywords": [
          "box office",
          "gross",
          "negative reviews",
          "budget"
        ]
      },
      "chunk_type": "keyword"
    }
  ],
  "created_at": "2025-08-10T11:07:42.257044",
  "embedding_model": "text-embedding-3-large",
  "additional_metadata": {
    "run_id": "exp_20250810_081040",
    "language": "en",
    "query_id": null,
    "model": "text-embedding-3-large"
  }
}