{
  "document_id": "5",
  "chunk_type": "keyword",
  "language": "en",
  "num_chunks": 3,
  "chunks": [
    {
      "hash": "952c3bdb900c8fc1",
      "content": "As at most other universities, Notre Dame's students run a number of news media outlets. The nine student-run outlets include three newspapers, both a radio and television station, and several magazines and journals. Begun as a one-page journal in September 1876, the Scholastic magazine is issued twice monthly and claims to be the oldest continuous collegiate publication in the United States.",
      "start_idx": 0,
      "end_idx": 395,
      "sequence_num": 0,
      "metadata": {
        "key_sentence": "Notre Dame's students run a number of news media outlets.",
        "importance_score": 0.7,
        "context_window": 2,
        "keywords": [
          "Notre Dame",
          "students",
          "news media outlets"
        ]
      },
      "chunk_type": "keyword"
    },
    {
      "hash": "667e07ce8d7373d6",
      "content": "The newspapers have varying publication interests, with The Observer published daily and mainly reporting university and other news, and staffed by students from both Notre Dame and Saint Mary's College. Unlike Scholastic and The Dome, The Observer is an independent publication and does not have a faculty advisor or any editorial oversight from the University. In 1987, when some students believed that The Observer began to show a conservative bias, a liberal newspaper, Common Sense was published. Likewise, in 2003, when other students believed that the paper showed a liberal bias, the conservative paper Irish Rover went into production. Neither paper is published as often as The Observer; however, all three are distributed to all students.",
      "start_idx": 542,
      "end_idx": 1291,
      "sequence_num": 1,
      "metadata": {
        "key_sentence": "In 1987, when some students believed that The Observer began to show a conservative bias, a liberal newspaper, Common Sense was published.",
        "importance_score": 0.6,
        "context_window": 2,
        "keywords": [
          "Common Sense",
          "conservative bias",
          "liberal newspaper"
        ]
      },
      "chunk_type": "keyword"
    },
    {
      "hash": "2e04e9ede575f42b",
      "content": "Likewise, in 2003, when other students believed that the paper showed a liberal bias, the conservative paper Irish Rover went into production. Neither paper is published as often as The Observer; however, all three are distributed to all students. Finally, in Spring 2008 an undergraduate journal for political science research, Beyond Politics, made its debut.",
      "start_idx": 1044,
      "end_idx": 1405,
      "sequence_num": 2,
      "metadata": {
        "key_sentence": "In Spring 2008 an undergraduate journal for political science research, Beyond Politics, made its debut.",
        "importance_score": 0.5,
        "context_window": 2,
        "keywords": [
          "Beyond Politics",
          "undergraduate journal",
          "political science"
        ]
      },
      "chunk_type": "keyword"
    }
  ],
  "created_at": "2025-08-10T10:40:22.319984",
  "embedding_model": "text-embedding-3-large",
  "additional_metadata": {
    "run_id": "exp_20250810_081040",
    "language": "en",
    "query_id": null,
    "model": "text-embedding-3-large"
  }
}