{
  "document_id": "63",
  "chunk_type": "keyword",
  "language": "en",
  "num_chunks": 3,
  "chunks": [
    {
      "hash": "74db5169e9abdb2c",
      "content": "The Lobund Institute grew out of pioneering research in germ-free-life which began in 1928. This area of research originated in a question posed by Pasteur as to whether animal life was possible without bacteria. Though others had taken up this idea, their research was short lived and inconclusive.",
      "start_idx": 0,
      "end_idx": 299,
      "sequence_num": 0,
      "metadata": {
        "key_sentence": "The Lobund Institute grew out of pioneering research in germ-free-life which began in 1928.",
        "importance_score": 0.9,
        "context_window": 2,
        "keywords": [
          "Lobund Institute",
          "germ-free-life",
          "1928"
        ]
      },
      "chunk_type": "keyword"
    },
    {
      "hash": "6fcb6be3a36c1cad",
      "content": "This area of research originated in a question posed by Pasteur as to whether animal life was possible without bacteria. Though others had taken up this idea, their research was short lived and inconclusive. Lobund was the first research organization to answer definitively, that such life is possible and that it can be prolonged through generations. But the objective was not merely to answer Pasteur's question but also to produce the germ free animal as a new tool for biological and medical research. This objective was reached and for years Lobund was a unique center for the study and production of germ free animals and for their use in biological and medical investigations.",
      "start_idx": 92,
      "end_idx": 775,
      "sequence_num": 1,
      "metadata": {
        "key_sentence": "Lobund was the first research organization to answer definitively, that such life is possible and that it can be prolonged through generations.",
        "importance_score": 0.85,
        "context_window": 2,
        "keywords": [
          "Lobund",
          "research organization",
          "germ-free life",
          "prolonged generations"
        ]
      },
      "chunk_type": "keyword"
    },
    {
      "hash": "3720c3b56b6663e9",
      "content": "Today the work has spread to other universities. In the beginning it was under the Department of Biology and a program leading to the master's degree accompanied the research program. In the 1940s Lobund achieved independent status as a purely research organization and in 1950 was raised to the status of an Institute. In 1958 it was brought back into the Department of Biology as integral part of that department, but with its own program leading to the degree of PhD in Gnotobiotics.",
      "start_idx": 776,
      "end_idx": 1262,
      "sequence_num": 2,
      "metadata": {
        "key_sentence": "In the 1940s Lobund achieved independent status as a purely research organization and in 1950 was raised to the status of an Institute.",
        "importance_score": 0.75,
        "context_window": 2,
        "keywords": [
          "1940s",
          "independent status",
          "research organization",
          "Institute"
        ]
      },
      "chunk_type": "keyword"
    }
  ],
  "created_at": "2025-08-10T10:40:47.229520",
  "embedding_model": "text-embedding-3-large",
  "additional_metadata": {
    "run_id": "exp_20250810_081040",
    "language": "en",
    "query_id": null,
    "model": "text-embedding-3-large"
  }
}