{
  "document_id": "64",
  "chunk_type": "keyword",
  "language": "en",
  "num_chunks": 2,
  "chunks": [
    {
      "hash": "399b62daaf640267",
      "content": "The Review of Politics was founded in 1939 by Gurian, modeled after German Catholic journals. It quickly emerged as part of an international Catholic intellectual revival, offering an alternative vision to positivist philosophy. For 44 years, the Review was edited by Gurian, Matthew Fitzsimons, Frederick Crosson, and Thomas Stritch.",
      "start_idx": 0,
      "end_idx": 334,
      "sequence_num": 0,
      "metadata": {
        "key_sentence": "The Review of Politics was founded in 1939 by Gurian, modeled after German Catholic journals.",
        "importance_score": 0.9,
        "context_window": 2,
        "keywords": [
          "Review of Politics",
          "Gurian",
          "1939",
          "German Catholic journals"
        ]
      },
      "chunk_type": "keyword"
    },
    {
      "hash": "d11232928fcc92e9",
      "content": "It quickly emerged as part of an international Catholic intellectual revival, offering an alternative vision to positivist philosophy. For 44 years, the Review was edited by Gurian, Matthew Fitzsimons, Frederick Crosson, and Thomas Stritch. Intellectual leaders included Gurian, Jacques Maritain, Frank O'Malley, Leo Richard Ward, F. A. Hermens, and John U. Nef. It became a major forum for political ideas and modern political concerns, especially from a Catholic and scholastic tradition.",
      "start_idx": 94,
      "end_idx": 584,
      "sequence_num": 1,
      "metadata": {
        "key_sentence": "Intellectual leaders included Gurian, Jacques Maritain, Frank O'Malley, Leo Richard Ward, F. A. Hermens, and John U. Nef.",
        "importance_score": 0.75,
        "context_window": 2,
        "keywords": [
          "intellectual leaders",
          "Gurian",
          "Jacques Maritain",
          "Frank O'Malley",
          "Leo Richard Ward",
          "F. A. Hermens",
          "John U. Nef"
        ]
      },
      "chunk_type": "keyword"
    }
  ],
  "created_at": "2025-08-10T10:40:48.999391",
  "embedding_model": "text-embedding-3-large",
  "additional_metadata": {
    "run_id": "exp_20250810_081040",
    "language": "en",
    "query_id": null,
    "model": "text-embedding-3-large"
  }
}