{
  "document_id": "68",
  "chunk_type": "keyword",
  "language": "en",
  "num_chunks": 2,
  "chunks": [
    {
      "hash": "d3cf81f6dc45b5a1",
      "content": "As of 2012[update] research continued in many fields. The university president, John Jenkins, described his hope that Notre Dame would become \"one of the pre–eminent research institutions in the world\" in his inaugural address. The university has many multi-disciplinary institutes devoted to research in varying fields, including the Medieval Institute, the Kellogg Institute for International Studies, the Kroc Institute for International Peace studies, and the Center for Social Concerns. Recent research includes work on family conflict and child development, genome mapping, the increasing trade deficit of the United States with China, studies in fluid mechanics, computational science and engineering, and marketing trends on the Internet.",
      "start_idx": 0,
      "end_idx": 746,
      "sequence_num": 0,
      "metadata": {
        "key_sentence": "The university president, John Jenkins, described his hope that Notre Dame would become 'one of the pre–eminent research institutions in the world' in his inaugural address.",
        "importance_score": 0.9,
        "context_window": 2,
        "keywords": [
          "university president",
          "John Jenkins",
          "research institutions"
        ]
      },
      "chunk_type": "keyword"
    },
    {
      "hash": "712e8cb9e71b14c8",
      "content": "The university has many multi-disciplinary institutes devoted to research in varying fields, including the Medieval Institute, the Kellogg Institute for International Studies, the Kroc Institute for International Peace studies, and the Center for Social Concerns. Recent research includes work on family conflict and child development, genome mapping, the increasing trade deficit of the United States with China, studies in fluid mechanics, computational science and engineering, and marketing trends on the Internet. As of 2013, the university is home to the Notre Dame Global Adaptation Index which ranks countries annually based on how vulnerable they are to climate change and how prepared they are to adapt.",
      "start_idx": 228,
      "end_idx": 941,
      "sequence_num": 1,
      "metadata": {
        "key_sentence": "As of 2013, the university is home to the Notre Dame Global Adaptation Index which ranks countries annually based on how vulnerable they are to climate change and how prepared they are to adapt.",
        "importance_score": 0.75,
        "context_window": 2,
        "keywords": [
          "Notre Dame Global Adaptation Index",
          "climate change",
          "vulnerability",
          "adaptation"
        ]
      },
      "chunk_type": "keyword"
    }
  ],
  "created_at": "2025-08-10T10:40:43.125142",
  "embedding_model": "text-embedding-3-large",
  "additional_metadata": {
    "run_id": "exp_20250810_081040",
    "language": "en",
    "query_id": null,
    "model": "text-embedding-3-large"
  }
}