{
  "document_id": "74",
  "chunk_type": "keyword",
  "language": "en",
  "num_chunks": 2,
  "chunks": [
    {
      "hash": "a4ff837d9725651a",
      "content": "In 2014 the Notre Dame student body consisted of 12,179 students, with 8,448 undergraduates, 2,138 graduate and professional and 1,593 professional (Law, M.Div., Business, M.Ed.) students. Around 21–24% of students are children of alumni, and although 37% of students come from the Midwestern United States, the student body represents all 50 states and 100 countries.",
      "start_idx": 0,
      "end_idx": 368,
      "sequence_num": 0,
      "metadata": {
        "key_sentence": "In 2014 the Notre Dame student body consisted of 12,179 students, with 8,448 undergraduates, 2,138 graduate and professional and 1,593 professional (Law, M.Div., Business, M.Ed.) students.",
        "importance_score": 0.9,
        "context_window": 2,
        "keywords": [
          "student body",
          "enrollment",
          "undergraduates",
          "graduates"
        ]
      },
      "chunk_type": "keyword"
    },
    {
      "hash": "253d24a76fb32a70",
      "content": "As of March 2007[update] The Princeton Review ranked the school as the fifth highest 'dream school' for parents to send their children. As of March 2015[update] The Princeton Review ranked Notre Dame as the ninth highest. The school has been previously criticized for its lack of diversity, and The Princeton Review ranks the university highly among schools at which \"Alternative Lifestyles [are] Not an Alternative.\" It has also been commended by some diversity oriented publications; Hispanic Magazine in 2004 ranked the university ninth on its list of the top–25 colleges for Latinos, and The Journal of Blacks in Higher Education recognized the university in 2006 for raising enrollment of African-American students. With 6,000 participants, the university's intramural sports program was named in 2004 by Sports Illustrated as the best program in the country, while in 2007 The Princeton Review named it as the top school where \"Everyone Plays Intramural Sports.\"",
      "start_idx": 369,
      "end_idx": 1337,
      "sequence_num": 1,
      "metadata": {
        "key_sentence": "The school has been previously criticized for its lack of diversity, and The Princeton Review ranks the university highly among schools at which 'Alternative Lifestyles [are] Not an Alternative.'",
        "importance_score": 0.75,
        "context_window": 2,
        "keywords": [
          "diversity",
          "criticism",
          "Princeton Review"
        ]
      },
      "chunk_type": "keyword"
    }
  ],
  "created_at": "2025-08-10T10:40:45.430627",
  "embedding_model": "text-embedding-3-large",
  "additional_metadata": {
    "run_id": "exp_20250810_081040",
    "language": "en",
    "query_id": null,
    "model": "text-embedding-3-large"
  }
}