{
  "document_id": "149",
  "chunk_type": "query_aware",
  "language": "en",
  "num_chunks": 3,
  "chunks": [
    {
      "hash": "e2d9fc031ae8b45f",
      "content": "Since the construction of its oldest buildings, the university's physical plant has grown substantially. Over the years 29 residence halls have been built to accommodate students and each has been constructed with its own chapel. Many academic building were added together with a system of libraries, the most prominent of which is the Theodore Hesburgh Library, built in 1963 and today containing almost 4 million books. Since 2004, several buildings have been added, including the DeBartolo Performing Arts Cen",
      "start_idx": 0,
      "end_idx": 512,
      "sequence_num": 0,
      "metadata": {
        "relevance_score": 0.5,
        "relevance_reason": "fallback chunking",
        "answer_contribution": "general content",
        "keywords": [
          "built",
          "1963"
        ],
        "query_analysis": {
          "question_type": "information",
          "key_entities": [
            "library",
            "Notre Dame"
          ],
          "keywords": [
            "built",
            "1963"
          ],
          "required_info": [
            "name of the library",
            "location"
          ],
          "complexity": "simple"
        },
        "coverage": "unknown"
      },
      "chunk_type": "query_aware"
    },
    {
      "hash": "bc57e0e752027b8c",
      "content": "ter, the Guglielmino Complex, and the Jordan Hall of Science. Additionally, a new residence for men, Duncan Hall, was begun on March 8, 2007, and began accepting residents for the Fall 2008 semester. Ryan Hall was completed and began housing undergraduate women in the fall of 2009. A new engineering building, Stinson-Remick Hall, a new combination Center for Social Concerns/Institute for Church Life building, Geddes Hall, and a law school addition have recently been completed as well. Additionally the new h",
      "start_idx": 512,
      "end_idx": 1024,
      "sequence_num": 1,
      "metadata": {
        "relevance_score": 0.5,
        "relevance_reason": "fallback chunking",
        "answer_contribution": "general content",
        "keywords": [
          "built",
          "1963"
        ],
        "query_analysis": {
          "question_type": "information",
          "key_entities": [
            "library",
            "Notre Dame"
          ],
          "keywords": [
            "built",
            "1963"
          ],
          "required_info": [
            "name of the library",
            "location"
          ],
          "complexity": "simple"
        },
        "coverage": "unknown"
      },
      "chunk_type": "query_aware"
    },
    {
      "hash": "aa883c6e918523df",
      "content": "ockey arena opened in the fall of 2011. The Stayer Center for Executive Education, which houses the Mendoza College of Business Executive Education Department opened in March 2013 just South of the Mendoza College of Business building. Because of its long athletic tradition, the university features also many building dedicated to sport. The most famous is Notre Dame Stadium, home of the Fighting Irish football team; it has been renovated several times and today it can hold more than 80 thousand people. Prom inent venues include also the Edmund P. Joyce Center, with indoor basketball and volleyball courts, and the Compton Family Ice Arena, a two-rink facility dedicated to hockey. Also, there are many outdoor fields, as the Frank Eck Stadium for baseball.",
      "start_idx": 1024,
      "end_idx": 1786,
      "sequence_num": 2,
      "metadata": {
        "relevance_score": 0.5,
        "keywords": [
          "built",
          "1963"
        ],
        "topics": [],
        "merged_from": 2,
        "original_chunks": [
          "149_query_aware_2",
          "149_query_aware_3"
        ]
      },
      "chunk_type": "query_aware"
    }
  ],
  "created_at": "2025-08-10T12:22:15.693813",
  "embedding_model": "text-embedding-3-large",
  "additional_metadata": {
    "run_id": "exp_20250810_081040",
    "language": "en",
    "query_id": "149",
    "model": "text-embedding-3-large"
  }
}