{
  "document_id": "264",
  "chunk_type": "query_aware",
  "language": "en",
  "num_chunks": 2,
  "chunks": [
    {
      "hash": "a2547275bb017bf5",
      "content": "Notre Dame alumni work in various fields. Alumni working in political fields include state governors, members of the United States Congress, and former United States Secretary of State Condoleezza Rice. A notable alumnus of the College of Science is Medicine Nobel Prize winner Eric F. Wieschaus. A number of university heads are alumni, including Notre Dame's current president, the Rev. John Jenkins. Additionally, many alumni are in the media, including talk show hosts Regis Philbin and Phil Donahue, and tel",
      "start_idx": 0,
      "end_idx": 512,
      "sequence_num": 0,
      "metadata": {
        "relevance_score": 0.5,
        "relevance_reason": "fallback chunking",
        "answer_contribution": "general content",
        "keywords": [
          "Secretary of State",
          "attended",
          "Notre Dame"
        ],
        "query_analysis": {
          "question_type": "information",
          "key_entities": [
            "Secretary of State",
            "Notre Dame"
          ],
          "keywords": [
            "Secretary of State",
            "attended",
            "Notre Dame"
          ],
          "required_info": [
            "name of the Secretary of State who attended Notre Dame"
          ],
          "complexity": "simple"
        },
        "coverage": "unknown"
      },
      "chunk_type": "query_aware"
    },
    {
      "hash": "5a36c40ae6b096c4",
      "content": "evision and radio personalities such as Mike Golic and Hannah Storm. With the university having high profile sports teams itself, a number of alumni went on to become involved in athletics outside the university, including professional baseball, basketball, football, and ice hockey players, such as Joe Theismann, Joe Montana, Tim Brown, Ross Browner, Rocket Ismail, Ruth Riley, Jeff Samardzija, Jerome Bettis, Brett Lebda, Olympic gold medalist Mariel Zagunis, professional boxer Mike Lee, former football coac hes such as Charlie Weis, Frank Leahy and Knute Rockne, and Basketball Hall of Famers Austin Carr and Adrian Dantley. Other notable alumni include prominent businessman Edward J. DeBartolo, Jr. and astronaut Jim Wetherbee.",
      "start_idx": 512,
      "end_idx": 1246,
      "sequence_num": 1,
      "metadata": {
        "relevance_score": 0.5,
        "keywords": [
          "Secretary of State",
          "attended",
          "Notre Dame"
        ],
        "topics": [],
        "merged_from": 2,
        "original_chunks": [
          "264_query_aware_1",
          "264_query_aware_2"
        ]
      },
      "chunk_type": "query_aware"
    }
  ],
  "created_at": "2025-08-10T12:41:57.413635",
  "embedding_model": "text-embedding-3-large",
  "additional_metadata": {
    "model": "text-embedding-3-large"
  }
}