{
  "document_id": "78",
  "chunk_type": "query_aware",
  "language": "en",
  "num_chunks": 2,
  "chunks": [
    {
      "hash": "96ac6c6c70291e68",
      "content": "About 80% of undergraduates and 20% of graduate students live on campus. The majority of the graduate students on campus live in one of four graduate housing complexes on campus, while all on-campus undergraduates live in one of the 29 residence halls. Because of the religious affiliation of the university, all residence halls are single-sex, with 15 male dorms and 14 female dorms. The university maintains a visiting policy (known as parietal hours) for those students who live in dormitories, specifying tim",
      "start_idx": 0,
      "end_idx": 512,
      "sequence_num": 0,
      "metadata": {
        "relevance_score": 0.5,
        "relevance_reason": "fallback chunking",
        "answer_contribution": "general content",
        "keywords": [
          "percentage",
          "live"
        ],
        "query_analysis": {
          "question_type": "information",
          "key_entities": [
            "undergrads",
            "Notre Dame campus"
          ],
          "keywords": [
            "percentage",
            "live"
          ],
          "required_info": [
            "percentage of undergrads living on campus"
          ],
          "complexity": "simple"
        },
        "coverage": "unknown"
      },
      "chunk_type": "query_aware"
    },
    {
      "hash": "0b3769f7ed4e2b9a",
      "content": "es when members of the opposite sex are allowed to visit other students' dorm rooms; however, all residence halls have 24-hour social spaces for students regardless of gender. Many residence halls have at least one nun and/or priest as a resident. There are no traditional social fraternities or sororities at the university, but a majority of students live in the same residence hall for all four years. Some intramural sports are based on residence hall teams, where the university offers the only non-military  academy program of full-contact intramural American football. At the end of the intramural season, the championship game is played on the field in Notre Dame Stadium.",
      "start_idx": 512,
      "end_idx": 1191,
      "sequence_num": 1,
      "metadata": {
        "relevance_score": 0.5,
        "keywords": [
          "live",
          "percentage"
        ],
        "topics": [],
        "merged_from": 2,
        "original_chunks": [
          "78_query_aware_1",
          "78_query_aware_2"
        ]
      },
      "chunk_type": "query_aware"
    }
  ],
  "created_at": "2025-08-10T11:46:36.486639",
  "embedding_model": "text-embedding-3-large",
  "additional_metadata": {
    "run_id": "exp_20250810_081040",
    "language": "en",
    "query_id": "78",
    "model": "text-embedding-3-large"
  }
}